============================================
Form Statement
============================================
FORM 2*(C 3, 2*C 10),BH 2.1,PIC(###.##)
---
    (source_file
      (line
        (statement
          (form_statement
            (form_multiplier
              (int))
            (formspec
              (spec)
              (number))
            (formspec
              (form_multiplier
                (int))
              (spec)
              (number))
            (formspec
              (spec)
              (number))
            (formspec)))
        (eol)))

============================================
CLOSE STATEMENT
============================================
00060 CLOSE #1,FREE,RELEASE:
00060 CLOSE #foo,DROP: ERROR IGNORE, ERROR 10
---
    (source_file
      (line
        (statement
          (form_statement
            (form_multiplier
              (int))
            (formspec
              (spec)
              (number))
            (formspec
              (form_multiplier
                (int))
              (spec)
              (number))
            (formspec
              (spec)
              (number))
            (formspec)))
        (eol)))      

============================================
CONTINUE
============================================
00350 CONTINUE
---
    (source_file
      (line
        (statement
          (form_statement
            (form_multiplier
              (int))
            (formspec
              (spec)
              (number))
            (formspec
              (form_multiplier
                (int))
              (spec)
              (number))
            (formspec
              (spec)
              (number))
            (formspec)))
        (eol)))

============================================
DATA
============================================
data "First Name","Last Name","Address","City","State","Zip Code","Shipping","Item 1","Item 2","Item 3"
data 10,10,10,10,4,9,3,3,3,3,1x32,
DATA 5.2E3, -5.2e+2, +5e-4
---
    (source_file
      (line
        (statement
          (form_statement
            (form_multiplier
              (int))
            (formspec
              (spec)
              (number))
            (formspec
              (form_multiplier
                (int))
              (spec)
              (number))
            (formspec
              (spec)
              (number))
            (formspec)))
        (eol)))
